<a href="https://colab.research.google.com/github/senjuti238/Machine-Learning-practice/blob/main/(Simple_Linear_Regression)Day6_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Procedure need to follow to design prediction model

-need to understand dataset
-if dataset has labeled info
-if dataet has continuous data
-b4 implementation import necessary libs
-after importing libs, check for dataset loc 
-check for outliers
-after transforming split into training and testing

In [1]:
#importing libs

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
#import dataset

data = pd.read_csv("/content/Salary_Data.csv")

In [3]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [ ]:
# assign x and y var

x =